In [2]:
import numpy as n
import sqlalchemy as sql

%reload_ext sql

from snowflake.sqlalchemy import URL
from sqlalchemy import create_engine

user = 'sfadmin'
connection_string = "snowflake://{user}:{password}@aa85077.eu-central-1".format(user='usercd ', password="snflk_pwd")

%sql $connection_string

%sql use database courses;
%sql use warehouse compute_wh;
%sql use schema sch_czechita;

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Základní JOIN 
(podle numeric)

In [ ]:
%%sql
SELECT country.name 
FROM teror2
LEFT JOIN country ON teror2.country = country.id;

SELECT c.name, t2.nkill, t2.nkillter, t2.gname, t2.latitude, t2.longitude
FROM teror2 AS t2
LEFT JOIN country AS c 
ON t2.country = c.id; -- pro line

SELECT c.name, t2.nkill, t2.nkillter, t2.gname, t2.latitude, t2.longitude
FROM teror2 t2
LEFT JOIN country c 
ON t2.country = c.id; -- pro linejsi

SELECT b.name, a.nkill, a.nkillter, a.gname, a.latitude, a.longitude
FROM teror2 a
LEFT JOIN country b ON a.country = b.id; -- pro bordelare

 ### Základní JOIN 
(pozor na sloupce)
- Takto se to nedělá!!!

In [ ]:
%%sql
SELECT c.name
FROM teror2 as t2
LEFT JOIN country as c 
ON t2.attacktype1 = c.id;

### Základní JOIN 
(jde to i přes stringy)

In [ ]:
%%sql
SELECT c.name
FROM teror as t
LEFT JOIN country as c
ON t.country_txt = c.name;

### Základní JOIN 
(více tabulek)

In [ ]:
%%sql
SELECT c.name, atyp.name
FROM teror2 as t2
LEFT JOIN country AS c
ON t2.country = c.id
LEFT JOIN attacktype AS atyp
ON t2.attacktype1 = atyp.id;

### JOIN 
(více sloupců)
- Můžeme dostat i více řádků než je v původní tabulce

In [ ]:
%%sql
SELECT dd.name, t2.nkill
FROM teror2 AS t2
JOIN country_dirtydata AS dd
ON t2.country = dd.id;

### JOIN (LEFT a RIGHT)

In [ ]:
%%sql
SELECT t2.gname, 
       c.name as country, 
       atyp1.name as attack_type1, 
       atyp2.name as attack_type2, 
       atyp3.name as attack_type3
FROM teror2 as t2
LEFT JOIN country as c 
ON t2.country = c.id
LEFT JOIN attacktype as atyp1 
ON t2.attacktype1 = atyp1.id
LEFT JOIN attacktype as atyp2
ON t2.attacktype2 = atyp2.id
LEFT JOIN attacktype as atyp3 
ON t2.attacktype3 = atyp3.id;

### JOIN (INNER vs LEFT)

In [ ]:
%%sql
SELECT c.name as country, 
       atyp1.name as attack_type1, 
       atyp2.name as attack_type2, 
       atyp3.name as attack_type3
FROM teror2 as t2
LEFT JOIN country as c 
ON t2.country = c.id
JOIN attacktype as atyp1 
ON t2.attacktype1 = atyp1.id
JOIN attacktype as atyp2
ON t2.attacktype2 = atyp2.id
JOIN attacktype as atyp3 
ON t2.attacktype3 = atyp3.id; -- default pro JOIN je INNER JOIN (neni treba specifikovat), vrati pouze zaznamy, pro ktere najde v obou tabulkach shodu
                          
SELECT c.name as country, 
       atyp1.name as attack_type1, 
       atyp2.name as attack_type2, 
       atyp3.name as attack_type3
FROM teror2 as t2
LEFT JOIN country as c 
ON t2.country = c.id
JOIN attacktype as atyp1 
ON t2.attacktype1 = atyp1.id
JOIN attacktype as atyp2
ON t2.attacktype2 = atyp2.id
JOIN attacktype as atyp3 
ON t2.attacktype3 = atyp3.id; -- to stejne jako predchozi

SELECT c.name as country, 
       atyp1.name as attack_type1, 
       atyp2.name as attack_type2, 
       atyp3.name as attack_type3
FROM teror2 as t2
LEFT JOIN country as c 
ON t2.country = c.id
LEFT JOIN attacktype as atyp1 
ON t2.attacktype1 = atyp1.id
LEFT JOIN attacktype as atyp2
ON t2.attacktype2 = atyp2.id
LEFT JOIN attacktype as atyp3 
ON t2.attacktype3 = atyp3.id; -- vrati vsechny zaznamy z tabulky teror2 a snazi se k nim doparovat attack type

### FULL OUTER JOIN

In [ ]:
-- vrati zaznamy, pro ktere najde shodu plus zbyle zaznamy z obou tabulek, pouziva se zridka

### JOIN a WHERE

In [ ]:
%%sql
SELECT gname, city, nwound FROM teror2 AS t2 
JOIN country AS c ON t2.country = c.id 
WHERE c.name = 'Slovak Republic' AND YEAR(t2.eventdate) = 2016;